uploads/customers/123/supportdesk/9901/comments/NewSOAP Message.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://wservice.rtt.co.za/ws_DEMO/">
   <soapenv:Header/>
   <soapenv:Body>
      <PackStoreExport>
         <packstoreHeader>
            <!--Optional:-->
            <Pack>
               <!--Zero or more repetitions:-->
               <structPackStoreHeaders>
                  <!--Optional:-->
                  <SerialKey></SerialKey>
                  <!--Optional:-->
                  <WhseId></WhseId>
                  <!--Optional:-->
                  <PackKey>0021X144</PackKey>
                  <!--Optional:-->
                  <PackDescr>Canon item 0021x144</PackDescr>
                  <!--Optional:-->
                  <PackUom1>CS</PackUom1>
                  <!--Optional:-->
                  <CaseCnt>24</CaseCnt>
                  <!--Optional:-->
                  <IsWhQty1></IsWhQty1>
                  <!--Optional:-->
                  <ReplenishUom1>N</ReplenishUom1>
                  <!--Optional:-->
                  <ReplenishZone1>CASE</ReplenishZone1>
                  <!--Optional:-->
                  <CartonizeUom1>N</CartonizeUom1>
                  <!--Optional:-->
                  <LengthUom1>0</LengthUom1>
                  <!--Optional:-->
                  <WidthUom1>0</WidthUom1>
                  <!--Optional:-->
                  <HeightUom1>0</HeightUom1>
                  <!--Optional:-->
                  <CubeUom1>0</CubeUom1>
                  <!--Optional:-->
                  <PackUom2>IP</PackUom2>
                 <!--Optional:-->
                  <InnerPack>6</InnerPack>
                  <!--Optional:-->
                  <IsWhQty2></IsWhQty2>
                  <!--Optional:-->
                  <ReplenishUom2>N</ReplenishUom2>
                  <!--Optional:-->
                  <ReplenishZone2>N</ReplenishZone2>
                  <!--Optional:-->
                  <CartonizeUom2>N</CartonizeUom2>
                  <!--Optional:-->
                  <LengthUom2>0</LengthUom2>
                  <!--Optional:-->
                  <WidthUom2>0</WidthUom2>
                  <!--Optional:-->
                  <HeightUom2>0</HeightUom2>
                  <!--Optional:-->
                  <CubeUom2>0</CubeUom2>
                  <!--Optional:-->
                  <PackUom3>EA</PackUom3>
                  <!--Optional:-->
                  <Qty>1</Qty>
                  <!--Optional:-->
                  <IsWhQty3></IsWhQty3>
                  <!--Optional:-->
                  <ReplenishUom3>Y</ReplenishUom3>
                  <!--Optional:-->
                  <ReplenishZone3>N</ReplenishZone3>
                  <!--Optional:-->
                  <CartonizeUom3>Y</CartonizeUom3>
                  <!--Optional:-->
                  <LengthUom3>0</LengthUom3>
                  <!--Optional:-->
                  <WidthUom3>0</WidthUom3>
                  <!--Optional:-->
                  <HeightUom3>0</HeightUom3>
                  <!--Optional:-->
                  <CubeUom3>0</CubeUom3>
                  <!--Optional:-->
                  <PackUom4>PL</PackUom4>
                  <!--Optional:-->
                  <Pallet>720</Pallet>
                  <!--Optional:-->
                  <IsWhQty4></IsWhQty4>
                  <!--Optional:-->
                  <ReplenishUom4>N</ReplenishUom4>
                  <!--Optional:-->
                  <ReplenishZone4>N</ReplenishZone4>
                  <!--Optional:-->
                  <CartonizeUom4>N</CartonizeUom4>
                  <!--Optional:-->
                  <LengthUom4>0</LengthUom4>
                  <!--Optional:-->
                  <WidthUom4>0</WidthUom4>
                  <!--Optional:-->
                  <HeightUom4>0</HeightUom4>
                  <!--Optional:-->
                  <CubeUom4>0</CubeUom4>
                  <!--Optional:-->
                  <PalletWoodLength>0</PalletWoodLength>
                  <!--Optional:-->
                  <PalletWoodWidth>0</PalletWoodWidth>
                  <!--Optional:-->
                  <PalletWoodHeight>0</PalletWoodHeight>
                  <!--Optional:-->
                  <PalletTi>6</PalletTi>
                  <!--Optional:-->
                  <PalletHi>5</PalletHi>
                  </structPackStoreHeaders>
            </Pack>
         </packstoreHeader>
      </PackStoreExport>
   </soapenv:Body>
</soapenv:Envelope>
